[
    {
        "recipe_id": "1",
        "recipe_name": "Miso Soup",
        "ingredients": [
            "Dashi",
            "Miso paste",
            "Tofu",
            "Green onions",
            "Dashi"
        ],
        "cooking_method": "1. Boil dashi in a saucepan. 2. Add miso paste and stir until it dissolves. 3. Add tofu and cook for a few minutes. 4. Garnish with chopped green onions.",
        "rating": 4.5,
        "chef_id": "1"
    },
    {
        "recipe_id": "2",
        "recipe_name": "Tempura",
        "ingredients": [
            "Shrimp",
            "Vegetables",
            "Flour",
            "Egg",
            "Ice water"
        ],
        "cooking_method": "1. Prepare tempura batter by mixing flour, egg, and ice water. 2. Dip shrimp and vegetables in the batter. 3. Deep-fry in hot oil until golden brown. 4. Serve with dipping sauce.",
        "rating": 4.2,
        "chef_id": "1"
    },
    {
        "recipe_id": "3",
        "recipe_name": "Yakitori",
        "ingredients": [
            "Shrimp",
            "Assorted vegetables",
            "Flour",
            "Cornstarch",
            "Baking powder",
            "Egg",
            "Ice water",
            "Tempura dipping sauce"
        ],
        "cooking_method": "1. Mix flour, cornstarch, baking powder, egg, and ice water in a bowl to make batter. 2. Dip shrimp and assorted vegetables into the batter. 3. Heat up a pot of oil to 350°F/175°C. 4. Fry the shrimp and vegetables in the oil until the batter is golden brown. 5. Serve hot with tempura dipping sauce.",
        "rating": 4.2,
        "chef_id": "1"
    },
    {
        "recipe_id": "4",
        "recipe_name": "Ramen",
        "ingredients": [
            "Ramen noodles",
            "Broth",
            "Chashu pork",
            "Green onions",
            "Egg"
        ],
        "cooking_method": "1. Cook ramen noodles according to package instructions. 2. Heat up broth. 3. Add chashu pork and green onions to the broth. 4. Boil an egg and cut in half. 5. Place cooked noodles in a bowl. 6. Pour the hot broth with chashu pork over the noodles. 7. Add the boiled egg and garnish with additional green onions.",
        "rating": 4.6,
        "chef_id": "2"
    },
    {
        "recipe_id": "5",
        "recipe_name": "Tonkatsu",
        "ingredients": [
            "Pork loin",
            "Panko bread crumbs",
            "Flour",
            "Egg",
            "Cabbage",
            "Tonkatsu sauce"
        ],
        "cooking_method": "1. Pound pork loin to tenderize. 2. Coat the pork in flour, then egg, then panko bread crumbs. 3. Deep-fry in hot oil until golden brown. 4. Cut the cabbage into thin strips. 5. Serve the tonkatsu with the cabbage and tonkatsu sauce.",
        "rating": 4.3,
        "chef_id": "2"
    },
    {
        "recipe_id": "6",
        "recipe_name": "Okonomiyaki",
        "ingredients": [
            "Flour",
            "Egg",
            "Cabbage",
            "Yamaimo",
            "Tenkasu",
            "Bacon",
            "Okonomiyaki sauce",
            "Mayonnaise"
        ],
        "cooking_method": "1. Mix flour, egg, cabbage, yamaimo, and tenkasu to make batter. 2. Heat up a flat pan or griddle. 3. Pour the batter onto the pan and add bacon on top. 4. Flip the okonomiyaki over and cook until both sides are golden brown. 5. Drizzle okonomiyaki sauce and mayonnaise on top. 6. Serve with additional toppings if desired.",
        "rating": 4.7,
        "chef_id": "2"
    },
    {
        "recipe_id": "7",
        "recipe_name": "Gyoza",
        "ingredients": [
            "Ground pork",
            "Cabbage",
            "Garlic",
            "Ginger",
            "Soy sauce",
            "Sesame oil",
            "Gyoza wrappers"
        ],
        "cooking_method": "1. Mix ground pork, chopped cabbage, minced garlic, grated ginger, soy sauce, and sesame oil to make the filling. 2. Place a spoonful of filling in the center of a gyoza wrapper. 3. Fold the wrapper and pleat the edges. 4. Pan-fry the gyoza until the bottom is crispy. 5. Add water to the pan and cover with a lid to steam the gyoza until cooked through. 6. Serve with dipping sauce.",
        "rating": 4.4,
        "chef_id": "3"
    },
    {
        "recipe_id": "8",
        "recipe_name": "Miso Soup",
        "ingredients": [
            "Dashi",
            "Miso paste",
            "Tofu",
            "Green onions",
            "Seaweed"
        ],
        "cooking_method": "1. Prepare dashi broth according to package instructions. 2. Bring the dashi to a simmer. 3. Add miso paste and stir until dissolved. 4. Cut tofu into small cubes and add to the soup. 5. Cut green onions into thin slices and add to the soup. 6. Cut seaweed into small pieces and add to the soup. 7. Simmer the soup for a few minutes. 8. Serve hot.",
        "rating": 4.2,
        "chef_id": "3"
    },
    {
        "recipe_id": "9",
        "recipe_name": "Tempura",
        "ingredients": [
            "Shrimp",
            "Assorted vegetables",
            "Flour",
            "Cornstarch",
            "Egg",
            "Ice-cold water",
            "Dipping sauce"
        ],
        "cooking_method": "1. Mix flour, cornstarch, egg, and ice-cold water to make batter. 2. Cut shrimp and vegetables into bite-sized pieces. 3. Dip the shrimp and vegetables into the batter. 4. Deep-fry in hot oil until golden brown. 5. Serve with dipping sauce.",
        "rating": 4.5,
        "chef_id": "3"
    },
    {
        "recipe_id": "10",
        "recipe_name": "Nikujaga",
        "ingredients": [
            "Thinly sliced beef",
            "Potato",
            "Onion",
            "Carrot",
            "Sake",
            "Sugar",
            "Soy sauce"
        ],
        "cooking_method": "1. Slice potato, onion, and carrot into bite-sized pieces. 2. Heat up a pot with dashi, sake, sugar, and soy sauce. 3. Add the sliced vegetables to the pot and let them simmer until they're almost cooked through. 4. Add thinly sliced beef to the pot and let it cook until the beef is no longer pink. 5. Serve hot.",
        "rating": 4.0,
        "chef_id": "4"
    },
    {
        "recipe_id": "11",
        "recipe_name": "Chirashi sushi",
        "ingredients": [
            "Sushi rice",
            "Assorted sashimi",
            "Egg",
            "Carrot",
            "Shiitake mushrooms",
            "Kanpyo",
            "Sesame seeds",
            "Nori",
            "Wasabi",
            "Soy sauce",
            "Pickled ginger"
        ],
        "cooking_method": "1. Cook sushi rice according to instructions. 2. Mix sesame seeds into the cooked rice. 3. Cut assorted sashimi, egg, carrot, and shiitake mushrooms into small pieces. 4. Rehydrate kanpyo in water and cook until tender. 5. Place the cooked sushi rice into a bowl. 6. Top the rice with the assorted sashimi, egg, carrot, shiitake mushrooms, and kanpyo. 7. Garnish with nori and wasabi. 8. Serve with soy sauce and pickled ginger.",
        "rating": 4.5,
        "chef_id": "4"
    },
    {
        "recipe_id": "12",
        "recipe_name": "Takoyaki",
        "ingredients": [
            "Octopus",
            "Flour",
            "Egg",
            "Dashi",
            "Green onions",
            "Takoyaki sauce",
            "Mayonnaise",
            "Aonori",
            "Katsuobushi"
        ],
        "cooking_method": "1. Mix flour, egg, dashi, and chopped octopus to make batter. 2. Pour the batter into a takoyaki pan. 3. Add chopped green onions on top. 4. Flip the takoyaki balls over with a skewer until they are crispy on all sides. 5. Drizzle takoyaki sauce and mayonnaise on top. 6. Garnish with a sprinkle of aonori and katsuobushi.",
        "rating": 4.7,
        "chef_id": "4"
    },
    {
        "recipe_id": "13",
        "recipe_name": "Gyoza",
        "ingredients": [
            "Ground pork",
            "Cabbage",
            "Garlic",
            "Ginger",
            "Soy sauce",
            "Sesame oil",
            "Gyoza wrappers"
        ],
        "cooking_method": "1. Mix ground pork, chopped cabbage, garlic, ginger, soy sauce, and sesame oil in a bowl. 2. Place a spoonful of filling in the center of a gyoza wrapper. 3. Fold the wrapper in half and seal the edges by crimping with your fingers. 4. Heat up a non-stick pan with oil. 5. Place the gyoza in the pan and cook until the bottom is golden brown. 6. Add water to the pan and cover with a lid. 7. Steam the gyoza until the filling is cooked through. 8. Serve hot with dipping sauce.",
        "rating": 4.4,
        "chef_id": "5"
    },
    {
        "recipe_id": "14",
        "recipe_name": "Sukiyaki",
        "ingredients": [
            "Thinly sliced beef",
            "Assorted vegetables",
            "Tofu",
            "Shirataki noodles",
            "Raw eggs",
            "Sukiyaki sauce"
        ],
        "cooking_method": "1. Heat up a skillet with sukiyaki sauce. 2. Place the thinly sliced beef and assorted vegetables into the skillet. 3. Cook the ingredients in the sauce until tender. 4. Add shirataki noodles and tofu to the skillet. 5. Break raw eggs into the skillet and let them cook slightly. 6. Serve hot.",
        "rating": 4.1,
        "chef_id": "5"
    },
    {
        "recipe_id": "15",
        "recipe_name": "Oyakodon",
        "ingredients": [
            "Chicken thigh",
            "Onion",
            "Egg",
            "Dashi",
            "Soy sauce",
            "Mirin",
            "Sugar",
            "Green onions",
            "Steamed rice"
        ],
        "cooking_method": "1. Slice chicken thigh and onion into bite-sized pieces. 2. In a pan, cook the chicken and onion with dashi, soy sauce, mirin, and sugar until the chicken is cooked through. 3. Beat eggs in a separate bowl. 4. Pour the eggs over the chicken and onion mixture. 5. Cover the pan and let the eggs cook until set. 6. Serve over a bed of steamed rice and garnish with chopped green onions.",
        "rating": 4.2,
        "chef_id": "5"
    },
    {
        "recipe_id": "16",
        "recipe_name": "Okonomiyaki",
        "ingredients": [
            "Flour",
            "Egg",
            "Water",
            "Cabbage",
            "Bacon",
            "Green onions",
            "Okonomiyaki sauce",
            "Mayonnaise",
            "Aonori",
            "Katsuobushi"
        ],
        "cooking_method": "1. Mix flour, egg, and water in a bowl to make batter. 2. Add chopped cabbage, bacon, and green onions to the batter. 3. Heat up a non-stick pan with oil. 4. Pour the batter into the pan and flatten into a pancake shape. 5. Cook until the bottom is golden brown. 6. Flip the okonomiyaki over and cook until the other side is golden brown. 7. Drizzle okonomiyaki sauce and mayonnaise on top. 8. Garnish with a sprinkle of aonori and katsuobushi.",
        "rating": 4.6,
        "chef_id": "6"
    },
    {
        "recipe_id": "17",
        "recipe_name": "Tonkatsu",
        "ingredients": [
            "Pork cutlet",
            "Flour",
            "Egg",
            "Panko breadcrumbs",
            "Cabbage",
            "Tonkatsu sauce"
        ],
        "cooking_method": "1. Coat pork cutlet in flour, egg, and panko breadcrumbs in that order. 2. Heat up a pan with oil. 3. Place the pork cutlet in the pan and cook until both sides are golden brown. 4. Let the pork cutlet rest for a few minutes before slicing. 5. Serve with shredded cabbage and tonkatsu sauce.",
        "rating": 4.3,
        "chef_id": "6"
    },
    {
        "recipe_id": "18",
        "recipe_name": "Yakitori",
        "ingredients": [
            "Chicken thigh",
            "Sake",
            "Soy sauce",
            "Mirin",
            "Green onions"
        ],
        "cooking_method": "1. Cut chicken thigh into bite-sized pieces. 2. Thread chicken onto skewers. 3. Heat up a grill or grill pan. 4. Brush the chicken with a mixture of sake, soy sauce, and mirin. 5. Grill the chicken skewers until the chicken is cooked through. 6. Garnish with chopped green onions.",
        "rating": 4.0,
        "chef_id": "6"
    }
]